research/visualization_methods/outputs/Drone Dynamics__drone_model_3d/drone_model_3d.dot
digraph G {
  "I" [label="I"];
  "MvNormal" [label="MvNormal"];
  "covariance" [label="covariance"];
  "drone" [label="drone"];
  "dt" [label="dt"];
  "environment" [label="environment"];
  "g" [label="g"];
  "get_gravity" [label="get_gravity"];
  "goal" [label="goal"];
  "hover_force" [label="hover_force"];
  "i" [label="i"];
  "initial_state" [label="initial_state"];
  "mean" [label="mean"];
  "s" [label="s"];
  "state_transition_3d" [label="state_transition_3d"];
  "u" [label="u"];
  "Σ" [label="Σ"];
  "μ" [label="μ"];
  "I" -> "s";
  "MvNormal" -> "s";
  "MvNormal" -> "u";
  "covariance" -> "s";
  "drone" -> "μ";
  "dt" -> "μ";
  "environment" -> "g";
  "environment" -> "μ";
  "get_gravity" -> "g";
  "goal" -> "s";
  "hover_force" -> "u";
  "i" -> "μ";
  "initial_state" -> "s";
  "mean" -> "s";
  "s" -> "μ";
  "state_transition_3d" -> "μ";
  "u" -> "μ";
  "Σ" -> "u";
  "μ" -> "u";
}
