research/visualization_methods/outputs/Drone Dynamics__drone_model_3d/drone_model_3d.mmd
graph TD
  I["I"]
  MvNormal["MvNormal"]
  covariance["covariance"]
  drone["drone"]
  dt["dt"]
  environment["environment"]
  g["g"]
  get_gravity["get_gravity"]
  goal["goal"]
  hover_force["hover_force"]
  i["i"]
  initial_state["initial_state"]
  mean["mean"]
  s["s"]
  state_transition_3d["state_transition_3d"]
  u["u"]
  Σ["Σ"]
  μ["μ"]
  I --> s
  MvNormal --> s
  MvNormal --> u
  covariance --> s
  drone --> μ
  dt --> μ
  environment --> g
  environment --> μ
  get_gravity --> g
  goal --> s
  hover_force --> u
  i --> μ
  initial_state --> s
  mean --> s
  s --> μ
  state_transition_3d --> μ
  u --> μ
  Σ --> u
  μ --> u
